# Day 13 - Pandas Part-2

### Filtering Data from String In different ways

In [8]:
import pandas as pd
data = {
    "Name" : ["Nabil", "Nafis", "Towa", "Riyan", "Rayhan", "Hiya"],
    "Age" : [23, 16, 6, 9, 15, 24],
    "City" : ["York New", "Los Angeles", "New Jersey", "Chicago", "The new Delhi", "Boston"],
    "Salary" : [50000, 82000, 65000, 47000, 58000, 49000 ]
}

df = pd.DataFrame(data)
df

     Name  Age           City  Salary
0   Nabil   23       York New   50000
1   Nafis   16    Los Angeles   82000
2    Towa    6     New Jersey   65000
3   Riyan    9        Chicago   47000
4  Rayhan   15  The new Delhi   58000
5    Hiya   24         Boston   49000

In [9]:
# Finding "New" anywhere from a column or city ,,, case sensitive

df.loc[df['City'].str.contains("New")]

    Name  Age        City  Salary
0  Nabil   23    York New   50000
2   Towa    6  New Jersey   65000

In [10]:
# character case doesn't matter

df.loc[df['City'].str.contains("new", case= False)]

     Name  Age           City  Salary
0   Nabil   23       York New   50000
2    Towa    6     New Jersey   65000
4  Rayhan   15  The new Delhi   58000

### Regular expression
Regular expression is used for efficient text processing.

In [12]:
# city starts with "New" only

df.loc[df['City'].str.contains(r"^New")]

   Name  Age        City  Salary
2  Towa    6  New Jersey   65000

In [14]:
# name ends with "an" only

df.loc[df['Name'].str.contains(r"an$")]

     Name  Age           City  Salary
3   Riyan    9        Chicago   47000
4  Rayhan   15  The new Delhi   58000